In [7]:
import numpy as np

In [8]:
import pandas as pd

In [9]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [10]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [13]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=['ohio','colorado','utah','new york'],
                 columns=['ones','two','three','four'])

In [14]:
data

          ones  two  three  four
ohio         0    1      2     3
colorado     4    5      6     7
utah         8    9     10    11
new york    12   13     14    15

# **drop方法默认会删除索引对应的行**

**可以使用一个索引，则将会删除一行**

In [15]:
new_obj=obj.drop('c')

In [16]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

**也可以使用索引列表，则会删除列表对应的行**

In [18]:
obj.drop(['d','c'])#并不会修改原对象

a    0.0
b    1.0
e    4.0
dtype: float64

In [19]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

# drop可以传递axis=1或者axis='columns'来从列删除值

同样的可以通过列表或者单个索引

In [20]:
data.drop('two',axis=1)

          ones  three  four
ohio         0      2     3
colorado     4      6     7
utah         8     10    11
new york    12     14    15

In [21]:
data.drop(['two','four'],axis='columns')

          ones  three
ohio         0      2
colorado     4      6
utah         8     10
new york    12     14

# 以上都不会对原对象改变，可以指定参数对原对象改变

**指定inplace=True来修改原对象**

In [22]:
obj.drop('c',inplace=True)

In [23]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64